{
  "backend/main.mo": "Empty Motoko actor definition serving as the backend entry point.",
  "feature_evidence.json": "Feature evidence report documenting a completed text correction from 'वैशेलिया साइकोकेयर' to 'वैचेलिया साइकोकेयर' in the translations file.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of three frontend files: translations utility, Header component, and HomePage component, all related to the Vachellia Psychocare bilingual branding.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx, titled 'Cyber Security Awareness Platform'.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with seven routes (home, online safety, digital wellbeing, government initiatives, security measures, complaints, resources) wrapped in Theme and Language providers.",
  "frontend/src/components/BilingualText.tsx": "Component that renders text in English, Hindi, or both languages based on the current language context setting.",
  "frontend/src/components/ContentSection.tsx": "Card-based section component with bilingual title support, optional icon, and flexible content rendering.",
  "frontend/src/components/Footer.tsx": "Footer component displaying about info, emergency helplines (1930, 1091), resource links, copyright notice, and caffeine.ai attribution with bilingual support.",
  "frontend/src/components/Header.tsx": "Sticky header with Shield logo, bilingual 'Suraksha Shiksha' branding, desktop/mobile navigation for seven routes, and language toggle button.",
  "frontend/src/components/HelplineCard.tsx": "Card component displaying helpline information with phone icon, bilingual name and description, and prominent number display.",
  "frontend/src/components/LanguageToggle.tsx": "Button component that cycles through three language modes (both/en/hi) displaying current selection with Languages icon.",
  "frontend/src/components/Layout.tsx": "Root layout component wrapping Header, main content outlet, and Footer in a flex column structure.",
  "frontend/src/components/ResourceCard.tsx": "Card component for displaying downloadable or external resources with bilingual title/description, optional category badge, and action button.",
  "frontend/src/contexts/LanguageContext.tsx": "React context providing language state (both/en/hi) and translation helper function for bilingual text rendering throughout the app.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing authenticated/anonymous backend actor instances using React Query, Internet Identity, and automatic query invalidation on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme color schemes, including sidebar, chart, and UI component tokens using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that renders the root component with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/ComplaintMechanismsPage.tsx": "Page displaying cyber crime reporting options including emergency helplines (1930, 1091), online portals, and contact information with bilingual English/Hindi content.",
  "frontend/src/pages/DigitalWellbeingPage.tsx": "Tabbed page covering digital wellbeing topics including screen time impacts, social media addiction statistics, and mental health strategies with bilingual support.",
  "frontend/src/pages/GovernmentInitiativesPage.tsx": "Page showcasing Indian government cyber security initiatives (Cyber Surakshit Bharat, ISEA, Digital India) and resources like CERT-In with bilingual descriptions and external links.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section and six navigation cards for Online Safety, Digital Wellbeing, Government Initiatives, Security Measures, Report Cyber Crime, and Resources sections.",
  "frontend/src/pages/OnlineSafetyPage.tsx": "Bilingual page covering online safety fundamentals including password security, phishing awareness, social media privacy, secure browsing, and safe online shopping with expandable accordion sections and icons.",
  "frontend/src/pages/ResourcesPage.tsx": "Bilingual resources page with tabbed sections (Government, Educational, Tools) displaying external links to CERT-In, MeitY, Cyber Crime Portal, Digital India, and other cyber security resources using ResourceCard components.",
  "frontend/src/pages/SecurityMeasuresPage.tsx": "Bilingual page providing practical security tools and techniques including antivirus software recommendations, VPN usage, two-factor authentication, device security, WiFi safety, and backup strategies with accordion-based content organization.",
  "frontend/src/utils/translations.ts": "Translation object containing English and Hindi text pairs for navigation items, home page hero section, and branding elements used throughout the application.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, sidebar colors, border radius variables, custom animations for accordions, and plugins for typography and container queries.",
  "project_state.json": "Project metadata defining a bilingual cyber security awareness platform for Indian colleges with architectural notes, existing features covering homepage, online safety, digital wellbeing, government initiatives, security measures, and complaint mechanisms."
}